-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Май 15 2025 г., 13:53
-- Версия сервера: 9.1.0
-- Версия PHP: 8.3.14

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `sweet_world`
--

-- --------------------------------------------------------

--
-- Структура таблицы `categories`
--

DROP TABLE IF EXISTS `categories`;
CREATE TABLE IF NOT EXISTS `categories` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=19 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `categories`
--

INSERT INTO `categories` (`id`, `name`) VALUES
(1, 'Цукерки'),
(2, 'Шоколад'),
(3, 'Печиво'),
(4, 'Мармелад'),
(5, 'Желейні ведмедики'),
(6, 'Трюфелі'),
(7, 'Льодяники'),
(8, 'Карамель'),
(9, 'Зефір'),
(10, 'Пастила'),
(11, 'Медові цукерки'),
(12, 'Дитячі солодощі'),
(13, 'Десерти без цукру'),
(14, 'Сезонні солодощі'),
(15, 'Торти'),
(16, 'Кондитерські прилади'),
(18, 'Форми для випічки');

-- --------------------------------------------------------

--
-- Структура таблицы `feedback`
--

DROP TABLE IF EXISTS `feedback`;
CREATE TABLE IF NOT EXISTS `feedback` (
  `feedback_id` int NOT NULL AUTO_INCREMENT,
  `user_id` bigint DEFAULT NULL,
  `feedback_text` text NOT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`feedback_id`),
  KEY `user_id` (`user_id`)
) ENGINE=MyISAM AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `feedback`
--

INSERT INTO `feedback` (`feedback_id`, `user_id`, `feedback_text`, `created_at`) VALUES
(1, 1038982882, 'Найкращий бот серед всіх/ Оцінка 10/10', '2025-05-11 18:45:17');

-- --------------------------------------------------------

--
-- Структура таблицы `orders`
--

DROP TABLE IF EXISTS `orders`;
CREATE TABLE IF NOT EXISTS `orders` (
  `order_id` int NOT NULL AUTO_INCREMENT,
  `product_name` varchar(255) DEFAULT NULL,
  `quantity` int DEFAULT NULL,
  `customer_name` varchar(255) DEFAULT NULL,
  `phone_number` varchar(20) DEFAULT NULL,
  `status` varchar(50) DEFAULT NULL,
  `user_id` bigint DEFAULT NULL,
  PRIMARY KEY (`order_id`)
) ENGINE=MyISAM AUTO_INCREMENT=8 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `orders`
--

INSERT INTO `orders` (`order_id`, `product_name`, `quantity`, `customer_name`, `phone_number`, `status`, `user_id`) VALUES
(1, 'Формочка для еклерів', 1, 'Віктор', '0969301514', 'відхилено', 5198264106),
(2, 'Торт з ягодами', 3, 'Наталія', '0969301514', 'підтверджено', 1929583191),
(3, 'Торт з ягодами', 5, 'Наталія', '0967338066', 'підтверджено', 1929583191),
(4, 'Ручний міксер', 1, 'Кіріл', '0969301514', 'відхилено', 1929583191),
(5, 'Торт з ягодами', 5, 'Віктор', '0969301514', 'відхилено', 1929583191),
(6, '/menu', 1, 'Кіріл', '0969301514', 'відхилено', 1038982882),
(7, 'Формочка для кексів', 4, 'Віктор', '0969301514', 'підтверджено', 5198264106);

-- --------------------------------------------------------

--
-- Структура таблицы `products`
--

DROP TABLE IF EXISTS `products`;
CREATE TABLE IF NOT EXISTS `products` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL,
  `description` text,
  `price` decimal(10,2) DEFAULT NULL,
  `category_id` int DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `category_id` (`category_id`)
) ENGINE=MyISAM AUTO_INCREMENT=178 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `products`
--

INSERT INTO `products` (`id`, `name`, `description`, `price`, `category_id`) VALUES
(2, 'Лавандові цукерки', 'Ароматні цукерки з натуральною лавандою', 35.00, 1),
(120, 'Форма для тістечок', 'Ідеальна для приготування маленьких індивідуальних тістечок', 150.00, 18),
(4, 'Шоколадні трюфелі', 'Класичний смак із вершковим кремом', 45.00, 1),
(121, 'Формочка для еклерів', 'Форма для приготування смачних еклерів або подібних десертів', 130.00, 18),
(7, 'Желейні серця', 'Зі смаком полуниці та малини', 28.00, 1),
(132, 'Печиво з шоколадними шматочками', 'Хрустке з вишуканим смаком шоколаду', 30.00, 3),
(9, 'Шоколад з морською сіллю', 'Для гурманів', 60.00, 2),
(11, 'Пористий шоколад', 'Легкий і хрусткий', 46.00, 2),
(119, 'Форма для шоколаду', 'Силіконова форма для виготовлення домашнього шоколаду різних форм', 200.00, 18),
(15, 'Білий шоколад з мигдалем', 'М’який, ніжний смак', 50.00, 2),
(133, 'Пряничне печиво', 'З корицьовим ароматом і прянощами', 32.00, 3),
(17, 'Вівсяне печиво', 'З родзинками та медом', 22.00, 3),
(118, 'Формочка для пасок', 'Оригінальна форма для випікання традиційних пасок на свята', 250.00, 18),
(22, 'Лимонне печиво', 'З цедрою лимона', 26.00, 3),
(23, 'Печиво-серця', 'Ручна випічка з ваніллю', 29.00, 3),
(135, 'Літній мармелад', 'Поєднання полуниці та малина', 35.00, 4),
(134, 'Мармелад з ананасом', 'Тропічна свіжість в кожному шматочку', 38.00, 4),
(26, 'Мармелад з агар-агаром', 'Без желатину, для веганів', 34.00, 4),
(27, 'Кисло-солодкий мікс', 'З кислинкою лайму', 31.00, 4),
(117, 'Силіконова форма для кексів', 'Спеціальна форма для приготування міні-кексів та мафінів', 180.00, 18),
(29, 'Серця з мармеладу', 'Зі смаком полуниці', 33.00, 4),
(31, 'Ведмедики фруктові', 'Класичні желейки з фруктовим смаком', 30.00, 5),
(32, 'Кислі ведмедики', 'Зі смаком лимону і малини', 32.00, 5),
(34, 'Ведмедики в шоколаді', 'Желейка в шоколадній глазурі', 38.00, 5),
(116, 'Формочка для печива', 'Ідеальна форма для випікання різних видів печива з різними орнаментами', 120.00, 18),
(115, 'Силіконова форма для тортів', 'Гнучка та зручна форма для приготування круглих тортів', 350.00, 18),
(39, 'Кавові трюфелі', 'Із натуральною арабікою', 47.00, 6),
(131, 'Печиво з чорносливом', 'З натуральними сухофруктами', 27.00, 3),
(41, 'Трюфелі з горіхами', 'Фундук та мигдаль усередині', 48.00, 6),
(114, 'Вертлюг для тортів', 'Вертлюг для легкого обертання тортів під час декорування', 450.00, 16),
(44, 'Трюфелі з карамеллю', 'Мʼяка карамельна серцевина', 51.00, 6),
(130, 'Печиво з курагою', 'М’яке і ароматне з курагою', 25.00, 3),
(112, 'Лист для випічки', 'Лист для запікання в духовці', 120.00, 16),
(47, 'Фруктові льодяники', 'Манго, апельсин, полуниця', 21.00, 7),
(48, 'Льодяники з вітамінами', 'Для дітей і дорослих', 24.00, 7),
(113, 'Кондитерський шприц', 'Шприц для декорування тортів', 350.00, 16),
(50, 'Льодяники без цукру', 'На основі ізомальту', 23.00, 7),
(52, 'Карамель молочна', 'Мʼяка, тягуча, з вершками', 28.00, 8),
(53, 'Карамель з горіхами', 'З додаванням арахісу', 30.00, 8),
(111, 'Ручний міксер', 'Міксер з ручним керуванням', 600.00, 16),
(55, 'Солона карамель', 'Популярний трендовий смак', 31.00, 8),
(110, 'Лопатка для тортів', 'Легка пластиковая лопатка для розрізання тортів', 80.00, 16),
(109, 'Формочка для тортів', 'Кругла металеві формочка для тортів', 200.00, 16),
(106, 'Торт \"Тірамісу\"', 'Італійський торт з маскарпоне та кавою', 350.00, 15),
(107, 'Торт з ягодами', 'Торт з кремом та свіжими ягодами', 420.00, 15),
(61, 'Полуничний зефір', 'З натуральним пюре', 37.00, 9),
(62, 'Зефір у шоколаді', 'Комбінований смак', 38.00, 9),
(108, 'Міксер кухонний', 'Міксер для збивання та замішування', 1500.00, 16),
(65, 'Зефір без цукру', 'На основі еритриту', 40.00, 9),
(67, 'Полунична пастила', 'З пюре свіжої ягоди', 35.00, 10),
(105, 'Торт \"Фрукти в кремі\"', 'Легкий торт з фруктами та ванільним кремом', 500.00, 15),
(70, 'Пастила з м’ятою', 'Освіжаючий післясмак', 32.00, 10),
(71, 'Горіхова пастила', 'З додаванням подрібнених горіхів', 37.00, 10),
(104, 'Торт \"Червоний оксамит\"', 'Торт з червоним бісквітом та кремом', 450.00, 15),
(73, 'Медові кульки', 'Натуральний мед і прополіс', 28.00, 11),
(74, 'Лимонно-медові льодяники', 'Проти болю в горлі', 30.00, 11),
(103, 'Торт \"Наполеон\"', 'Класичний торт з багатошаровим кремом', 400.00, 15),
(76, 'Горіхово-медові квадрати', 'З фундуком та гречаним медом', 34.00, 11),
(102, 'Медовий торт', 'Ніжний медовий торт з кремом', 280.00, 15),
(101, 'Шоколадний торт', 'Смачний торт з шоколадним кремом', 350.00, 15),
(80, 'Дитячі жуйки', 'Без цукру, зі смаком полуниці', 18.00, 12),
(81, 'Цукерки-звірята', 'У формі ведмедиків та зайчиків', 20.00, 12),
(82, 'Веселі льодяники', 'Упаковка з героями мультиків', 22.00, 12),
(123, 'Цукерки з шоколадною начинкою', 'Молочний шоколад із кремовою начинкою', 42.00, 1),
(124, 'Цукерки з апельсином', 'Оригінальне поєднання солодкого та кислуватого', 36.00, 1),
(122, 'Медові цукерки з малиною', 'Солодка комбінація меду і малини', 33.00, 1),
(88, 'Горіхові кульки', 'Сухофрукти, какао, горіхи', 36.00, 13),
(127, 'Шоколад з малиною', 'Легкий та свіжий смак', 52.00, 2),
(125, 'Чорничні цукерки', 'З натуральним чорничним пюре', 37.00, 1),
(91, 'Чіа-пудинг', 'З ваніллю та ягодами', 40.00, 13),
(128, 'Органічний шоколад', 'Без додавання штучних інгредієнтів', 70.00, 2),
(93, 'Батончики енергії', 'Без глютену й цукру', 39.00, 13),
(126, 'Темний шоколад з перцем', 'Для справжніх любителів гострого', 65.00, 2),
(96, 'Осінній мармелад', 'Смак гарбуза та кориці', 27.00, 14),
(129, 'Шоколад зі смаком маракуї', 'Екзотичний фруктовий аромат', 68.00, 2),
(99, 'Валентинки', 'Зефірні серця в коробці', 34.00, 14),
(100, 'Хелловінські жуйки', 'Упаковка в стилі монстрів', 29.00, 14),
(136, 'Мармелад з цитрусовими', 'Соковитий смак апельсина і лимона', 40.00, 4),
(137, 'Вишневий мармелад', 'Солодкий і насичений смак вишні', 33.00, 4),
(138, 'Ведмедики з соком черешні', 'Соковиті і смачні', 33.00, 5),
(139, 'Ведмедики з йогуртом', 'Кремова текстура і кислуватий смак', 35.00, 5),
(140, 'Молочні ведмедики', 'Легкі і ніжні в кожному укусі', 30.00, 5),
(141, 'Ведмедики з карамельним смаком', 'Солодкі і ароматні', 34.00, 5),
(142, 'Трюфелі з малиновим пюре', 'Солодка ягідна начинка в трюфелі', 49.00, 6),
(143, 'Трюфелі з карамельним соусом', 'Карамельна начинка для справжніх ласунів', 53.00, 6),
(144, 'Трюфелі з малиною і горіхами', 'Поєднання ягід і хрустких горіхів', 55.00, 6),
(145, 'Молочні трюфелі', 'Легкі трюфелі з ніжним молочним кремом', 47.00, 6),
(146, 'Льодяники з лавандою', 'Ароматна квіткова нота в кожному льодянику', 25.00, 7),
(147, 'Льодяники з перцем', 'Для сміливих і екстремальних гурманів', 27.00, 7),
(148, 'Льодяники з вишневим смаком', 'Тропічний та солодкий смак вишні', 24.00, 7),
(149, 'Льодяники з кокосом', 'Ніжний тропічний смак кокоса', 26.00, 7),
(150, 'Карамель з лимонною цедрою', 'Соковита карамель з цитрусовим акцентом', 32.00, 8),
(151, 'Карамель з ягідним міксом', 'Смачне поєднання ягід у кожному укусі', 35.00, 8),
(152, 'Карамель з мигдалем', 'Хрусткий смак мигдалю в карамельній основі', 33.00, 8),
(153, 'Карамель зі смаком ванілі', 'Легкий і ніжний смак ванілі', 31.00, 8),
(154, 'Зефір з чорницею', 'Легкий зефір з насиченим смаком чорниці', 42.00, 9),
(155, 'Зефір з персиком', 'Солодкий і фруктовий смак персика', 41.00, 9),
(156, 'Рожевий зефір', 'Легкий і повітряний з нотками полуниці', 39.00, 9),
(157, 'Зефір з малиною', 'Соковита малина в кожному шматочку', 40.00, 9),
(158, 'Пастила з яблуками', 'Легкий смак яблук в кожному відрізку', 36.00, 10),
(159, 'Пастила з персиком', 'Тропічний смак персика для справжніх гурманів', 37.00, 10),
(160, 'Чорнична пастила', 'Освіжаюча пастила з чорницею', 38.00, 10),
(161, 'Пастила з бананом', 'Солодкий і фруктовий смак банана', 35.00, 10),
(162, 'Медові цукерки з імбиром', 'Лікувальний мед і спеції', 33.00, 11),
(163, 'Медові кульки з горіхами', 'Класичний медовий смак з додаванням горіхів', 35.00, 11),
(164, 'Медові цукерки з грушевим смаком', 'М’який смак груші в медовій цукерці', 32.00, 11),
(165, 'Лавандово-медові цукерки', 'З натуральним медом і ароматом лаванди', 34.00, 11),
(166, 'Дитячі шоколадні жуйки', 'Молочний шоколад у жувальній формі', 21.00, 12),
(167, 'Лялькові цукерки', 'Цукерки у формі маленьких ляльок', 19.00, 12),
(168, 'Дитячі гумові цукерки', 'Легкі і смачні гумові цукерки', 20.00, 12),
(169, 'Дитячі карамельки', 'Легкі і смачні карамельки для дітей', 22.00, 12),
(170, 'Чіа-пудинг з ягодами', 'З натуральними ягодами без додавання цукру', 42.00, 13),
(171, 'Горіхові батончики', 'Без цукру і з додаванням горіхів', 39.00, 13),
(172, 'Ягідний йогурт', 'Без цукру з натуральними ягодами', 41.00, 13),
(173, 'Пудинг з кокосовим молоком', 'Легкий кокосовий смак без цукру', 38.00, 13),
(174, 'Весняний мармелад', 'Смак квітів та свіжості', 28.00, 14),
(175, 'Літні льодяники', 'Соковитий смак ягід і фруктів', 25.00, 14),
(176, 'Осінній десерт', 'Гарбуза та кориці мікс', 30.00, 14),
(177, 'Святкові цукерки', 'Спеціальний набір для свят', 35.00, 14);

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

DROP TABLE IF EXISTS `users`;
CREATE TABLE IF NOT EXISTS `users` (
  `user_id` int NOT NULL,
  `username` varchar(255) NOT NULL,
  PRIMARY KEY (`user_id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`user_id`, `username`) VALUES
(1038982882, 'admin_user');
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
